'''
Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли.
'''
print("Введите строку:")
a = input()

for i in a:
    print(i)
