'''
Создать список из десяти целых чисел.
Вывести на экран каждое число, увеличенное на 1.
'''
a = [1, 3, 5, 6, 12, 43, 45, 66, 9, 23, 87]

for i in a:
    print(i + 1)
